// 1 Вивести на сторінку в один рядок через кому числа від 10 до 20.

let str = '10';
let n = 11;
for (n = 11; n <= 20; n++) {
    str = str+','+n;
}
document.write(str);




// 2 Вивести квадрати чисел від 10 до 20.
/*
for (let i = 10; i <= 20; i++) {
    console.log(i*i);
}
*/



// 3 Вивести таблицю множення на 7.
/*
for (let i = 1; i <=10; i++){
    console.log(`7 X ${i} = ${7*i}`)
}
*/



// 4 Знайти суму всіх цілих чисел від 1 до 15.
/*
let sum = 0
for ( let i = 1; i <= 15; i++) {
    sum = sum+i;
}
console.log(sum);
*/



//5 Знайти добуток усіх цілих чисел від 15 до 35.
/*
let mult = 1
for ( let i = 15; i <= 35; i++) {
    mult = mult*i;
}
console.log(mult);
*/



// 6 Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
/*
let average = 0;
for(let i = 1; i <=500;i++){
    average = (average+i);
}
console.log(average/500);
*/



// 7 Вивести суму лише парних чисел в діапазоні від 30 до 80.
/*
let sum = 0;
for(let i = 30; i <= 80; i = i + 2){
    sum = sum + i;
}
console.log(sum);
*/



// 8 Вивести всі числа в діапазоні від 100 до 200 кратні 3.
/*
for (let i = 100; i <= 200; i++){
    if(i % 3 === 0){
        console.log(i);
    };
}
*/



//  9 Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
/*
for (let i = 1; i <= 9; i++){
    console.log("Натуральне число "+i +", його дільники ↓");
        for(let j = 1; j<=9;j++){
            if(i%j == 0){
                console.log(j);
            }
        }
    }
*/
//



// 10 Визначити кількість його парних дільників.
/*
let str = 0
for (let i = 2; i <= 8; i=i+2){
    console.log("Натуральне число "+i +", його парні дільники ↓");
        for(let j = 2; j<=9; j=j+2){
            if(i%j == 0 ){
                console.log(j);
                str = str+1;
            }
        }
    }
    console.log(str+" - кількість вcих парних дільників натуральних чисел");
*/




// Знайти суму його парних дільників.
/*
let str = 0
for (let i = 2; i <= 8; i=i+2){
    console.log("Натуральне число "+i +", його парні дільники ↓");
        for(let j = 2; j<=9; j=j+2){
            if(i%j == 0 ){
                console.log(j);
                str = str+j;
            }
        }
    }
    console.log(str+" - cума вcих парних дільників натуральних чисел");
*/




// 12 Надрукувати повну таблицю множення від 1 до 10.
/*
for (let i = 1; i <=10; i++){
    console.log("Таблиця множення на "+i)
    for (let j = 1; j <=10; j++) {
        console.log(`${i} X ${j} = ${i*j}`); 
    }
}
*/